OFtutorialTest04_MRF/rhoPimpleFoam/debug_case_with_cyclicAMI/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    INFLOW
    {
        type            fixedValue;
        value           uniform 300;
    }

    OUTFLOW
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    BLADE
    {
        type            zeroGradient;
    }

    HUB
    {
        type            zeroGradient;
    }
    
    SHROUD
    {
        type            zeroGradient;
    }
    
    PER1
    {
        type            cyclicAMI;
    }
    
    PER2
    {
        type            cyclicAMI;
    }
}


// ************************************************************************* //
