OFtutorialTest04_MRF/rhoPimpleFoam/debug_case_with_cyclicAMI/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 2.6;

boundaryField
{


    INFLOW
    {
        type            inletOutlet;
        inletValue      uniform 10;
        value           uniform 10;
    }
    OUTFLOW
    {
        type            inletOutlet;
        inletValue      uniform 10;
        value           uniform 10;
    }
    
    BLADE
    {
        type            omegaWallFunction;
        value           uniform 2.6;
    }

    HUB
    {
        type            omegaWallFunction;
        value           uniform 2.6;
    }
    
    SHROUD
    {
        type            omegaWallFunction;
        value           uniform 2.6;
    }
    
    PER1
    {
        type            cyclicAMI;
    }
    
    PER2
    {
        type            cyclicAMI;
    }
    
    
}


// ************************************************************************* //
